#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
#### Terraform Test 🧪``

<details><summary>Show Plan</summary>

```

terraform
module.reprocess_lambda.data.external.archive_prepare[0]: Reading...
module.weekly_report_lambda.data.external.archive_prepare[0]: Reading...
random_id.bucket_suffix: Refreshing state... [id=3wj6Eg]
data.external.build_layer: Reading...
module.ingestion_lambda.data.external.archive_prepare[0]: Reading...
module.sync_lambda.data.external.archive_prepare[0]: Reading...
module.api_lambda.data.external.archive_prepare[0]: Reading...
module.apply_schema_lambda.data.external.archive_prepare[0]: Reading...
module.processing_lambda.data.external.archive_prepare[0]: Reading...
module.sync_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sync_lambda.local_file.archive_plan[0]: Refreshing state... [id=da7cb1fe114d6c84d722aba2a2ea228fc98877f6]
module.sync_lambda.null_resource.archive[0]: Refreshing state... [id=4115155551609459337]
module.weekly_report_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.ingestion_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.ingestion_lambda.local_file.archive_plan[0]: Refreshing state... [id=4ec7624b0b0e871b9c6d691f590b5c7086a121d1]
module.weekly_report_lambda.local_file.archive_plan[0]: Refreshing state... [id=465ffcac3b561ab1d3d946eeb2d636bfcf50f8c9]
module.apply_schema_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.apply_schema_lambda.local_file.archive_plan[0]: Refreshing state... [id=a3ff0185b97cb42f4e54a01ceea938414b8efd86]
module.weekly_report_lambda.null_resource.archive[0]: Refreshing state... [id=5616459882653334956]
module.api_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.ingestion_lambda.null_resource.archive[0]: Refreshing state... [id=5269776424891637110]
module.api_lambda.local_file.archive_plan[0]: Refreshing state... [id=d1dae1353214cf547aae3015e546efb71074ba42]
module.apply_schema_lambda.null_resource.archive[0]: Refreshing state... [id=6930981539651382285]
module.reprocess_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.weekly_report_lambda.terraform_data.package_filename_for_hash[0]: Refreshing state... [id=c494766f-20b0-14ba-49ee-f3e1dda5bc61]
module.api_lambda.null_resource.archive[0]: Refreshing state... [id=8539290949388351459]
module.reprocess_lambda.local_file.archive_plan[0]: Refreshing state... [id=7fd0638a98ab65536a42f28a0967307616657de5]
module.processing_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.processing_lambda.local_file.archive_plan[0]: Refreshing state... [id=7fd0638a98ab65536a42f28a0967307616657de5]
module.apply_schema_lambda.terraform_data.package_filename_for_hash[0]: Refreshing state... [id=f2957434-80d4-842b-9537-e39a5efbda7b]
module.reprocess_lambda.null_resource.archive[0]: Refreshing state... [id=99458880377211315]
module.processing_lambda.null_resource.archive[0]: Refreshing state... [id=6305827594556081962]
module.apply_schema_lambda.data.aws_partition.current: Reading...
module.weekly_report_lambda.data.aws_caller_identity.current: Reading...
module.api_lambda.data.aws_region.current: Reading...
module.sync_lambda.data.aws_region.current: Reading...
module.processing_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.weekly_report_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion_lambda.data.aws_region.current: Reading...
module.apply_schema_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_s3_bucket.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
module.api_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_s3_bucket.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
module.sync_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.processing_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sqs.data.aws_partition.current[0]: Reading...
module.weekly_report_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.weekly_report_lambda.data.aws_region.current: Reading...
module.reprocess_lambda.data.aws_partition.current: Reading...
module.api_gateway.aws_cloudwatch_log_group.this["this"]: Refreshing state... [id=/aws/apigateway/gov-graph-http/default]
module.sqs.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_cloudwatch_event_rule.weekly_report_schedule: Refreshing state... [id=gov-graph-weekly-report]
module.processing_lambda.data.aws_partition.current: Reading...
module.weekly_report_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.reprocess_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.fck_nat.data.aws_region.current: Reading...
module.processing_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.sqs.data.aws_caller_identity.current[0]: Reading...
module.ingestion_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-ingestion]
module.apply_schema_lambda.data.aws_caller_identity.current: Reading...
module.fck_nat.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_secretsmanager_secret.sam_api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:900881668640:secret:gov-graph/sam-api-key-otjedi]
module.weekly_report_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.weekly_report_lambda.data.aws_partition.current: Reading...
module.weekly_report_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
aws_sns_topic.weekly_report: Refreshing state... [id=arn:aws:sns:us-east-1:900881668640:gov-graph-weekly-report]
module.apply_schema_lambda.data.aws_caller_identity.current: Read complete after 1s [id=900881668640]
module.api_lambda.data.aws_partition.current: Reading...
module.api_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue]
module.sqs.data.aws_caller_identity.current[0]: Read complete after 1s [id=900881668640]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=gov-graph-postgres-db-20260216212626761700000003]
module.reprocess_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.reprocess_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.reprocess_lambda.data.aws_region.current: Reading...
module.reprocess_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.apply_schema_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.apply_schema_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.apply_schema_lambda.data.aws_region.current: Reading...
module.apply_schema_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.weekly_report_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-weekly-report]
aws_secretsmanager_secret.neo4j_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:900881668640:secret:gov-graph/neo4j-credentials-otjedi]
module.fck_nat.data.aws_caller_identity.current: Reading...
module.processing_lambda.data.aws_region.current: Reading...
module.processing_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.entity_cache: Refreshing state... [id=gov-graph-entity-cache]
module.fck_nat.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
aws_cloudwatch_event_rule.daily_ingestion: Refreshing state... [id=gov-graph-daily-ingestion]
module.sync_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-sync]
module.api_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-api]
module.apply_schema_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-apply-schema]
module.sqs.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue-dlq]
module.ingestion_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sync_lambda.data.aws_partition.current: Reading...
module.sync_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion_lambda.data.aws_caller_identity.current: Reading...
aws_cloudwatch_event_rule.daily_sync: Refreshing state... [id=gov-graph-daily-sync]
module.sqs.data.aws_region.current[0]: Reading...
module.sqs.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=em9az8nzqf]
aws_budgets_budget.cost_control: Refreshing state... [id=900881668640:gov-graph-monthly-budget]
module.sync_lambda.data.aws_caller_identity.current: Reading...
module.ingestion_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.api_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.reprocess_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-reprocess]
module.processing_lambda.data.aws_caller_identity.current: Reading...
module.sync_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a0ed0489aafa6f11]
module.processing_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.processing_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-processing]
module.fck_nat.data.aws_iam_policy_document.instance_assume_role_policy: Reading...
module.fck_nat.data.aws_iam_policy_document.instance_assume_role_policy: Read complete after 0s [id=2851119427]
module.api_lambda.data.aws_caller_identity.current: Reading...
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_gXSszxI6o]
module.api_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.reprocess_lambda.data.aws_caller_identity.current: Reading...
module.reprocess_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.sync_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sync_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion_lambda.data.aws_partition.current: Reading...
module.ingestion_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.fck_nat.data.aws_ami.main[0]: Reading...
module.processing_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-processing]
module.apply_schema_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.weekly_report_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-weekly-report]
module.apply_schema_lambda.data.aws_iam_policy.vpc[0]: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.reprocess_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.processing_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.api_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.fck_nat.data.aws_ami.main[0]: Read complete after 1s [id=ami-0bdee4ce8b0dab1d0]
module.reprocess_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-reprocess]
module.apply_schema_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-apply-schema]
module.reprocess_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
aws_sns_topic_subscription.weekly_report_email: Refreshing state... [id=arn:aws:sns:us-east-1:900881668640:gov-graph-weekly-report:ba96a22a-ff20-4476-9e6a-a8cfa74a18e8]
module.processing_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.ingestion_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-ingestion]
module.sync_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.sqs.aws_sqs_queue_redrive_allow_policy.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue-dlq]
module.sqs.aws_sqs_queue_redrive_policy.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue]
module.api_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.api_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-api]
module.fck_nat.aws_iam_role.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
module.sync_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-sync]
module.ingestion_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.sync_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.fck_nat.data.aws_iam_policy_document.main: Reading...
module.fck_nat.data.aws_iam_policy_document.main: Read complete after 0s [id=4163073303]
module.api_gateway.aws_apigatewayv2_stage.this[0]: Refreshing state... [id=$default]
aws_s3_bucket_lifecycle_configuration.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
module.ingestion_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
aws_s3_bucket_server_side_encryption_configuration.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
aws_s3_bucket_public_access_block.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
aws_s3_bucket_public_access_block.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
aws_s3_bucket_server_side_encryption_configuration.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
aws_cloudwatch_dashboard.main: Refreshing state... [id=gov-graph-pipeline]
aws_cognito_user_pool_domain.main: Refreshing state... [id=gov-graph-auth]
aws_cognito_identity_provider.google[0]: Refreshing state... [id=us-east-1_gXSszxI6o:Google]
module.processing_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing-vpc]
module.fck_nat.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::900881668640:policy/gov-graph-vpc-dev-fck-nat]
module.fck_nat.aws_iam_instance_profile.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
module.reprocess_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess-vpc]
module.apply_schema_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema-vpc]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00df93395a3de1b99]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a16e51bf6562fe1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d4177696b68125d9]
module.ingestion_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=784662949]
module.ingestion_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion-vpc]
module.weekly_report_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.weekly_report_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3090105299]
module.sync_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.sync_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2114500597]
module.api_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2835697535]
module.apply_schema_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.apply_schema_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1533766019]
module.reprocess_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.reprocess_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3132420699]
module.processing_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.processing_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2336315575]
module.api_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-api:gov-graph-api-vpc]
module.sync_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync-vpc]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-08fb9e80128439196]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-02c0d73f58d96bc72]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e39574bd48e8a571]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-058b44ace592a9d57]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fe63ecf679aab38c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01fa06d6419a969fa]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b1d17136f1fb8e8f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-053e772fde1a62252]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f880cf677712bd79]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a2be6d5196ca77fb]
aws_cognito_user_pool_client.frontend: Refreshing state... [id=1af9t6fgqmlo17dn62gfg7vo43]
module.ingestion_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion-logs]
module.weekly_report_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-weekly-report:gov-graph-weekly-report-logs]
module.sync_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync-logs]
module.api_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-api:gov-graph-api-logs]
module.apply_schema_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema-logs]
module.reprocess_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess-logs]
module.processing_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing-logs]
module.fck_nat.aws_iam_role_policy_attachment.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat/arn:aws:iam::900881668640:policy/gov-graph-vpc-dev-fck-nat]
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0de6c293b57a4ea11]
module.fck_nat.data.aws_vpc.main: Reading...
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=gov-graph-vpc-dev]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-053e772fde1a622521080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-061cb41b48b613f77]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fcc481f54846413c]
aws_amplify_app.frontend: Refreshing state... [id=d2680fpqajv7av]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-088dfc22780587dd6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07d9483c03bec6d1c]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2791188885]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05877bb5be33f8d6a]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0953c0cac84d820cb]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-1413376883]
module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1130667915]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-020750015273cd590]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-04fd6faea2d1413d6]
aws_amplify_branch.main: Refreshing state... [id=d2680fpqajv7av/main]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-V6ATTPOIWYN5EEL3ZFJOES36PI]
module.fck_nat.data.aws_vpc.main: Read complete after 1s [id=vpc-0a0ed0489aafa6f11]
module.fck_nat.aws_security_group.main: Refreshing state... [id=sg-0b8ea77d68c03f5d0]
module.apply_schema_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema]
module.ingestion_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion]
module.processing_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing]
module.reprocess_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess]
module.sync_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync]
module.api_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-api:gov-graph-api]
module.fck_nat.aws_network_interface.main: Refreshing state... [id=eni-08e6dfa52ca9841ea]
module.fck_nat.aws_route.main["private-1"]: Refreshing state... [id=r-rtb-0b1d17136f1fb8e8f1080289494]
module.fck_nat.aws_route.main["private-0"]: Refreshing state... [id=r-rtb-01fa06d6419a969fa1080289494]
module.fck_nat.data.cloudinit_config.this: Reading...
module.fck_nat.data.cloudinit_config.this: Read complete after 0s [id=3932343572]
module.fck_nat.aws_launch_template.main: Refreshing state... [id=lt-08e45fb35ee00a9be]
module.fck_nat.aws_autoscaling_group.main[0]: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
data.external.build_layer: Still reading... [00m10s elapsed]
data.external.build_layer: Read complete after 11s [id=-]
aws_s3_object.layer_zip: Refreshing state... [id=gov-graph-lambda-builds-df08fa12/layer-15c69dd0399dcf55e80a23730ffd0240.zip]
aws_lambda_layer_version.dependencies: Refreshing state... [id=arn:aws:lambda:us-east-1:900881668640:layer:gov-graph-dependencies:17]
module.apply_schema_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-apply-schema]
module.sync_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-sync]
module.reprocess_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-reprocess]
module.processing_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-processing]
module.api_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-api]
module.ingestion_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-ingestion]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.ingestion_target: Refreshing state... [id=gov-graph-daily-ingestion-IngestionLambda]
aws_lambda_permission.allow_eventbridge_sync: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.sync_target: Refreshing state... [id=gov-graph-daily-sync-SyncLambda]
module.weekly_report_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-weekly-report:gov-graph-weekly-report]
module.processing_lambda.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=97ab914b-92a3-4bcc-9800-2ef782e75342]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_integration.api_lambda: Refreshing state... [id=pwjj4wa]
module.weekly_report_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-weekly-report]
aws_apigatewayv2_route.default: Refreshing state... [id=ukh93ak]
aws_lambda_permission.allow_eventbridge_weekly_report: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.weekly_report_target: Refreshing state... [id=gov-graph-weekly-report-WeeklyReportLambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cognito_identity_provider.google[0] will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-1_gXSszxI6o:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.main will be updated in-place
  ~ resource "aws_cognito_user_pool" "main" {
        id                         = "us-east-1_gXSszxI6o"
      ~ mfa_configuration          = "OFF" -> "OPTIONAL"
        name                       = "gov-graph-users"
        tags                       = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (17 unchanged attributes hidden)

      + software_token_mfa_configuration {
          + enabled = true
        }

        # (6 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.frontend will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "frontend" {
      ~ explicit_auth_flows                           = [
          - "ALLOW_USER_PASSWORD_AUTH",
            # (2 unchanged elements hidden)
        ]
        id                                            = "1af9t6fgqmlo17dn62gfg7vo43"
        name                                          = "gov-graph-frontend"
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.layer_zip will be updated in-place
  ~ resource "aws_s3_object" "layer_zip" {
        id                            = "gov-graph-lambda-builds-df08fa12/layer-15c69dd0399dcf55e80a23730ffd0240.zip"
      ~ source                        = "/home/kahlb/Documents/govgraph/infra/builds/layer.zip" -> "/home/runner/work/govgraph/govgraph/infra/builds/layer.zip"
        tags                          = {}
      + version_id                    = (known after apply)
        # (26 unchanged attributes hidden)
    }

  # module.api_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c6b527df19cb8098fd74f2e9b6294260799647d21dc32dc64b30139d10a05d08.zip" -> "builds/884e59c606adbfc6190ca519c6a4d71116485dbd70eade29559ba4a995fd3546.zip"
        id                             = "gov-graph-api"
      ~ last_modified                  = "2026-02-25T21:09:06.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.api_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/884e59c606adbfc6190ca519c6a4d71116485dbd70eade29559ba4a995fd3546.plan.json"
      + id                   = (known after apply)
    }

  # module.api_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8539290949388351459" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c6b527df19cb8098fd74f2e9b6294260799647d21dc32dc64b30139d10a05d08.zip" -> "builds/884e59c606adbfc6190ca519c6a4d71116485dbd70eade29559ba4a995fd3546.zip"
          ~ "timestamp" = "1771983064504872000" -> "1772057806229418000"
        }
    }

  # module.apply_schema_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6930981539651382285" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1771890306353977000" -> "1772057806233114000"
            # (1 unchanged element hidden)
        }
    }

  # module.ingestion_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/25713c73754b18f8ba2ea0b8b407bb335557fbe41efd272f006e025c016f77a4.zip" -> "builds/2f57317839598a9b4ac348426fbaba8f827d962f3d2c8b1237f324acd9711ee0.zip"
        id                             = "gov-graph-ingestion"
      ~ last_modified                  = "2026-02-25T01:31:38.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2f57317839598a9b4ac348426fbaba8f827d962f3d2c8b1237f324acd9711ee0.plan.json"
      + id                   = (known after apply)
    }

  # module.ingestion_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5269776424891637110" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/25713c73754b18f8ba2ea0b8b407bb335557fbe41efd272f006e025c016f77a4.zip" -> "builds/2f57317839598a9b4ac348426fbaba8f827d962f3d2c8b1237f324acd9711ee0.zip"
          ~ "timestamp" = "1771977872570672000" -> "1772057806225401000"
        }
    }

  # module.processing_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f792ab765dc6ee2858a3f74455901c854eb84ed84d42c9e99b35f18772bbb086.zip" -> "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.zip"
        id                             = "gov-graph-processing"
      ~ last_modified                  = "2026-02-25T01:31:38.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.processing_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.plan.json"
      + id                   = (known after apply)
    }

  # module.processing_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6305827594556081962" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f792ab765dc6ee2858a3f74455901c854eb84ed84d42c9e99b35f18772bbb086.zip" -> "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.zip"
          ~ "timestamp" = "1771977872580053000" -> "1772057806274060000"
        }
    }

  # module.reprocess_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f792ab765dc6ee2858a3f74455901c854eb84ed84d42c9e99b35f18772bbb086.zip" -> "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.zip"
        id                             = "gov-graph-reprocess"
      ~ last_modified                  = "2026-02-25T01:31:38.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.reprocess_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.plan.json"
      + id                   = (known after apply)
    }

  # module.reprocess_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "99458880377211315" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f792ab765dc6ee2858a3f74455901c854eb84ed84d42c9e99b35f18772bbb086.zip" -> "builds/db15d544ffaa4ca2ac947cdd9c2cc30ed328373927b1f93cc2b307317160d863.zip"
          ~ "timestamp" = "1771977872580053000" -> "1772057806263037000"
        }
    }

  # module.sync_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/629262043a6b443be3c1d84cb20565968e45fd298b5c775c522d15cb28f7c82a.zip" -> "builds/72000c6f0a049e1609fde0bbf3c9c5e5ce8c603105c13d70107d4c42bb21947d.zip"
        id                             = "gov-graph-sync"
      ~ last_modified                  = "2026-02-25T01:31:38.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sync_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/72000c6f0a049e1609fde0bbf3c9c5e5ce8c603105c13d70107d4c42bb21947d.plan.json"
      + id                   = (known after apply)
    }

  # module.sync_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4115155551609459337" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/629262043a6b443be3c1d84cb20565968e45fd298b5c775c522d15cb28f7c82a.zip" -> "builds/72000c6f0a049e1609fde0bbf3c9c5e5ce8c603105c13d70107d4c42bb21947d.zip"
          ~ "timestamp" = "1771977872573173000" -> "1772057806160460000"
        }
    }

  # module.weekly_report_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5616459882653334956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1771977872579571000" -> "1772057806221601000"
            # (1 unchanged element hidden)
        }
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
      ~ backup_retention_period               = 0 -> 7
        id                                    = "db-V6ATTPOIWYN5EEL3ZFJOES36PI"
        tags                                  = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (74 unchanged attributes hidden)
    }

Plan: 12 to add, 10 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>